user_space_memory_access_from_kernel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-14 Tue 22:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>User Space Memory Access From The Linux Kernel</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yannik" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">User Space Memory Access From The Linux Kernel</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org81e7895">1. The User Space Memory Access API</a></li>
<li><a href="#orgb5ae26d">2. An example to map user space pages into kernel</a></li>
</ul>
</div>
</div>


<div id="outline-container-org81e7895" class="outline-2">
<h2 id="org81e7895"><span class="section-number-2">1</span> The User Space Memory Access API</h2>
<div class="outline-text-2" id="text-1">
<p>
In Linux, the kernel itself resides in one address space, and each process resides in its own address space.
there are group of kernel APIs to manipulate user memory, these functions are listed in below table.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">access_ok</td>
<td class="org-left">Checks the validity of the user space memory pointer</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">get_user</td>
<td class="org-left">Gets a simple variable from user space</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">put_user</td>
<td class="org-left">Puts a simple variable to user space</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">copy_to_user</td>
<td class="org-left">Copies a block of data from the kernel to user space</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">copy_from_user</td>
<td class="org-left">Copies a block of data from user space to the kernel</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">strnlen_user</td>
<td class="org-left">Gets the size of a string buffer in user space</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">strncpy_from_user</td>
<td class="org-left">Copies a string from user space into the kernel</td>
</tr>
</tbody>
</table>

<p>
except above functions, you can map some pages of memory buffer into kernel virtual space with get_user_pages_unlocked.
the following section will show you an example to map a page of user space buffer into the kernel.
</p>
</div>
</div>

<div id="outline-container-orgb5ae26d" class="outline-2">
<h2 id="orgb5ae26d"><span class="section-number-2">2</span> An example to map user space pages into kernel</h2>
<div class="outline-text-2" id="text-2">
<p>
Let me show the code directly.
</p>

<div class="org-src-container">
<pre class="src src-c">
#include &lt;linux/types.h&gt;
#include &lt;linux/module.h&gt;
#include &lt;linux/init.h&gt;
#include &lt;linux/string.h&gt;
#include &lt;linux/slab.h&gt;
#include &lt;linux/fs.h&gt;
#include &lt;linux/errno.h&gt;
#include &lt;linux/kernel.h&gt;
#include &lt;linux/major.h&gt;
#include &lt;linux/mutex.h&gt;
#include &lt;linux/device.h&gt;
#include &lt;linux/uaccess.h&gt;
#include &lt;linux/mm.h&gt;
#include &lt;asm/cacheflush.h&gt;

#define MAX_PAGES 5

struct cdev_buffer {
	struct page **mapped_pages;
	unsigned long offset;
	int nr_pages;
};

static int cdev_map_user_pages(struct cdev_buffer *cbuf,
			      const unsigned int max_pages, unsigned long uaddr,
			      size_t count, int rw)
{
	unsigned long end = (uaddr + count + PAGE_SIZE - 1) &gt;&gt; PAGE_SHIFT;
	unsigned long start = uaddr &gt;&gt; PAGE_SHIFT;
	const int nr_pages = end - start;
	int res, i, j;
	struct page **pages;

	if ((uaddr + count) &lt; uaddr)
		return -EINVAL;

	if (nr_pages &gt; max_pages)
		return -ENOMEM;

	if (count == 0)
		return 0;

	if ((pages = kmalloc(max_pages * sizeof(*pages), GFP_KERNEL)) == NULL)
		return -ENOMEM;

	/* Try to fault in all of the necessary pages */
	/* rw==WRITE means write into memory area */
	res = get_user_pages_unlocked(
		uaddr,
		nr_pages,
		pages,
		rw == WRITE ? FOLL_WRITE : 0); /* don't force */

	/* Errors and no page mapped should return here */
	if (res &lt; nr_pages)
		goto out_unmap;

	for (i = 0; i &lt; nr_pages; i++) {
		flush_dcache_page(pages[i]);
	}

	cbuf-&gt;offset = uaddr &amp; ~PAGE_MASK;
	cbuf-&gt;mapped_pages = pages;

	return nr_pages;
 out_unmap:
	if (res &gt; 0) {
		for (j = 0; j &lt; res; j++)
			put_page(pages[j]);
		res = 0;
	}
	kfree(pages);
	return res;
}

static int cdev_unmap_user_pages(struct cdev_buffer *cbuf,
				const unsigned int nr_pages, int dirtied)
{
	int i;

	for (i = 0; i &lt; nr_pages; i++) {
		struct page *page = cbuf-&gt;mapped_pages[i];

		if (dirtied)
			SetPageDirty(page);

		put_page(page);
	}
	kfree(cbuf-&gt;mapped_pages);
	cbuf-&gt;mapped_pages = NULL;

	return 0;
}

static int cdev_open(struct inode *inode, struct file *filp)
{
	struct cdev_buffer *cbuf = NULL;

	cbuf = kzalloc(sizeof(struct cdev_buffer), GFP_KERNEL);
	if (!cbuf) {
		pr_err("%s: alloc cdev_buffer failed\n", __func__);
		return -1;
	}

	filp-&gt;private_data = cbuf;
	return 0;
}

static int cdev_close(struct inode *inode, struct file *filp)
{
	struct cdev_buffer *cbuf = filp-&gt;private_data;

	if (cbuf) {
		if (cbuf-&gt;nr_pages) {
			cdev_unmap_user_pages(cbuf, cbuf-&gt;nr_pages, true);
		}
		kfree(cbuf);
	}
	return 0;
}

static ssize_t cdev_read(struct file *filp, char __user *buf,
			 size_t count, loff_t *ppos)
{
	struct cdev_buffer *cbuf = filp-&gt;private_data;
	struct page *page = cbuf-&gt;mapped_pages[0];
	unsigned long kaddr = (unsigned long)page_address(page) + cbuf-&gt;offset;

	pr_debug("%s: read data(%lu): %s\n", __func__, count, (char *)kaddr);

	return count - copy_to_user(buf, (const void *)kaddr, count);
}

static ssize_t cdev_write(struct file *filp, const char __user *buf,
			  size_t count, loff_t *ppos)
{
	struct cdev_buffer *cbuf = filp-&gt;private_data;
	int ret;

	ret = cdev_map_user_pages(cbuf, MAX_PAGES, (unsigned long)buf, count, WRITE);
	if (ret &lt;= 0) {
		pr_err("%s: map user pages failed.\n", __func__);
		return 0;
	}

	cbuf-&gt;nr_pages = ret;

	return count;
}

static const struct file_operations cdev_fops = {
	.owner	 = THIS_MODULE,
	.open    = cdev_open,
	.read    = cdev_read,
	.write   = cdev_write,
	.release = cdev_close,
	.llseek  = no_llseek,
};

static char *cdev_devnode(struct device *dev, umode_t *mode)
{
	if (mode)
		*mode = 0666;
	return kasprintf(GFP_KERNEL, "cdev/%s", dev_name(dev));
}

static struct class *cdev_class;
int major = 0;
int minor = 0;

static int __init cdev_init(void)
{
	major = register_chrdev(0, "cdev", &amp;cdev_fops);
	if (major &lt; 0) {
		pr_err("register character device failed\n");
		return major;
	}

	cdev_class = class_create(THIS_MODULE, "cdev");
	if (IS_ERR(cdev_class))
		return PTR_ERR(cdev_class);

	cdev_class-&gt;devnode = cdev_devnode;

	device_create(cdev_class, NULL, MKDEV(major, minor),
		      NULL, "cdev%d", minor);

	return 0;
}

static void __exit cdev_exit(void)
{
	device_destroy(cdev_class, MKDEV(major, minor));
	class_destroy(cdev_class);
	unregister_chrdev(major, "cdev");
}

module_init(cdev_init);
module_exit(cdev_exit);

MODULE_AUTHOR("Yannik Li");
MODULE_LICENSE("GPL");

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-07-14 Tue 00:00</p>
<p class="author">Author: yannik</p>
<p class="date">Created: 2020-07-14 Tue 22:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
